; domain
(define (domain BLOCKS)

(:requirements :negative-preconditions
  	:typing
)

(:types block)

(:predicates (on ?x - block ?y - block) (ontable ?x - block) (clear ?x - block) (handempty) (holding ?x - block))

(:action pick-up
  :parameters (?x - block)
  :precondition (and (clear ?x) (ontable ?x) (handempty))
  :effect (and (not (ontable ?x)) (not (clear ?x)) (not (handempty)) (holding ?x)))

(:action put-down
  :parameters (?x - block)
  :precondition (holding ?x)
  :effect (and (not (holding ?x)) (clear ?x) (handempty) (ontable ?x)))

(:action stack
  :parameters (?x - block ?y - block)
  :precondition (and (holding ?x) (clear ?y))
  :effect (and (not (holding ?x)) (not (clear ?y)) (clear ?x) (handempty) (on ?x ?y)))

(:action unstack
  :parameters (?x - block ?y - block)
  :precondition (and (on ?x ?y) (clear ?x) (handempty))
  :effect (and (holding ?x) (clear ?y) (not (clear ?x)) (not (handempty)) (not (on ?x ?y))))

)

; problem
(define (problem p2)
(:domain blocks)
(:objects
 b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 - block
)
(:init
(handempty)
(ontable b17)
(clear b12)
(on b11 b17)
(on b8 b11)
(on b1 b8)
(on b20 b1)
(on b12 b20)
(ontable b7)
(clear b18)
(on b19 b7)
(on b4 b19)
(on b14 b4)
(on b6 b14)
(on b3 b6)
(on b2 b3)
(on b16 b2)
(on b9 b16)
(on b10 b9)
(on b15 b10)
(on b5 b15)
(on b13 b5)
(on b18 b13)
)
(:goal (and
(on b1 b18)
(on b10 b1)
(on b17 b10)
(on b8 b17)
(on b13 b8)
(on b6 b13)
(on b7 b6)
(on b4 b7)
(on b16 b4)
(on b3 b16)
(on b11 b3)
(on b20 b11)
(on b9 b20)
(on b2 b9)
(on b12 b2)
(on b14 b12)
(on b19 b14)
(on b15 b19)
(on b5 b15)
))
)

; plan
1. (unstack b12 b20)
   deleted: (clear b12) (handempty) (on b12 b20)
   added: (holding b12) (clear b20)
   goals met: 1 of 19
2. (put-down b12)
   deleted: (holding b12)
   added: (clear b12) (handempty) (ontable b12)
   goals met: 1 of 19
3. (unstack b20 b1)
   deleted: (clear b20) (handempty) (on b20 b1)
   added: (holding b20) (clear b1)
   goals met: 1 of 19
4. (put-down b20)
   deleted: (holding b20)
   added: (clear b20) (handempty) (ontable b20)
   goals met: 1 of 19
5. (unstack b1 b8)
   deleted: (clear b1) (handempty) (on b1 b8)
   added: (holding b1) (clear b8)
   goals met: 1 of 19
6. (put-down b1)
   deleted: (holding b1)
   added: (clear b1) (handempty) (ontable b1)
   goals met: 1 of 19
7. (unstack b8 b11)
   deleted: (clear b8) (handempty) (on b8 b11)
   added: (holding b8) (clear b11)
   goals met: 1 of 19
8. (put-down b8)
   deleted: (holding b8)
   added: (clear b8) (handempty) (ontable b8)
   goals met: 1 of 19
9. (unstack b11 b17)
   deleted: (clear b11) (handempty) (on b11 b17)
   added: (holding b11) (clear b17)
   goals met: 1 of 19
10. (put-down b11)
   deleted: (holding b11)
   added: (clear b11) (handempty) (ontable b11)
   goals met: 1 of 19
11. (unstack b18 b13)
   deleted: (clear b18) (handempty) (on b18 b13)
   added: (holding b18) (clear b13)
   goals met: 1 of 19
12. (put-down b18)
   deleted: (holding b18)
   added: (clear b18) (handempty) (ontable b18)
   goals met: 1 of 19
13. (unstack b13 b5)
   deleted: (clear b13) (handempty) (on b13 b5)
   added: (holding b13) (clear b5)
   goals met: 1 of 19
14. (put-down b13)
   deleted: (holding b13)
   added: (clear b13) (handempty) (ontable b13)
   goals met: 1 of 19
15. (unstack b5 b15)
   deleted: (clear b5) (handempty) (on b5 b15)
   added: (holding b5) (clear b15)
   goals met: 0 of 19
16. (put-down b5)
   deleted: (holding b5)
   added: (clear b5) (handempty) (ontable b5)
   goals met: 0 of 19
17. (unstack b15 b10)
   deleted: (clear b15) (handempty) (on b15 b10)
   added: (holding b15) (clear b10)
   goals met: 0 of 19
18. (put-down b15)
   deleted: (holding b15)
   added: (clear b15) (handempty) (ontable b15)
   goals met: 0 of 19
19. (unstack b10 b9)
   deleted: (clear b10) (handempty) (on b10 b9)
   added: (holding b10) (clear b9)
   goals met: 0 of 19
20. (put-down b10)
   deleted: (holding b10)
   added: (clear b10) (handempty) (ontable b10)
   goals met: 0 of 19
21. (unstack b9 b16)
   deleted: (clear b9) (handempty) (on b9 b16)
   added: (holding b9) (clear b16)
   goals met: 0 of 19
22. (put-down b9)
   deleted: (holding b9)
   added: (clear b9) (handempty) (ontable b9)
   goals met: 0 of 19
23. (unstack b16 b2)
   deleted: (clear b16) (handempty) (on b16 b2)
   added: (holding b16) (clear b2)
   goals met: 0 of 19
24. (put-down b16)
   deleted: (holding b16)
   added: (clear b16) (handempty) (ontable b16)
   goals met: 0 of 19
25. (unstack b2 b3)
   deleted: (clear b2) (handempty) (on b2 b3)
   added: (holding b2) (clear b3)
   goals met: 0 of 19
26. (put-down b2)
   deleted: (holding b2)
   added: (clear b2) (handempty) (ontable b2)
   goals met: 0 of 19
27. (unstack b3 b6)
   deleted: (clear b3) (handempty) (on b3 b6)
   added: (holding b3) (clear b6)
   goals met: 0 of 19
28. (put-down b3)
   deleted: (holding b3)
   added: (clear b3) (handempty) (ontable b3)
   goals met: 0 of 19
29. (unstack b6 b14)
   deleted: (clear b6) (handempty) (on b6 b14)
   added: (holding b6) (clear b14)
   goals met: 0 of 19
30. (put-down b6)
   deleted: (holding b6)
   added: (clear b6) (handempty) (ontable b6)
   goals met: 0 of 19
31. (unstack b14 b4)
   deleted: (clear b14) (handempty) (on b14 b4)
   added: (holding b14) (clear b4)
   goals met: 0 of 19
32. (put-down b14)
   deleted: (holding b14)
   added: (clear b14) (handempty) (ontable b14)
   goals met: 0 of 19
33. (unstack b4 b19)
   deleted: (clear b4) (handempty) (on b4 b19)
   added: (holding b4) (clear b19)
   goals met: 0 of 19
34. (put-down b4)
   deleted: (holding b4)
   added: (clear b4) (handempty) (ontable b4)
   goals met: 0 of 19
35. (unstack b19 b7)
   deleted: (clear b19) (handempty) (on b19 b7)
   added: (holding b19) (clear b7)
   goals met: 0 of 19
36. (put-down b19)
   deleted: (holding b19)
   added: (clear b19) (handempty) (ontable b19)
   goals met: 0 of 19
37. (pick-up b1)
   deleted: (ontable b1) (clear b1) (handempty)
   added: (holding b1)
   goals met: 0 of 19
38. (stack b1 b18)
   deleted: (holding b1) (clear b18)
   added: (clear b1) (handempty) (on b1 b18)
   goals met: 1 of 19
39. (pick-up b10)
   deleted: (ontable b10) (clear b10) (handempty)
   added: (holding b10)
   goals met: 1 of 19
40. (stack b10 b1)
   deleted: (holding b10) (clear b1)
   added: (clear b10) (handempty) (on b10 b1)
   goals met: 2 of 19
41. (pick-up b17)
   deleted: (ontable b17) (clear b17) (handempty)
   added: (holding b17)
   goals met: 2 of 19
42. (stack b17 b10)
   deleted: (holding b17) (clear b10)
   added: (clear b17) (handempty) (on b17 b10)
   goals met: 3 of 19
43. (pick-up b8)
   deleted: (ontable b8) (clear b8) (handempty)
   added: (holding b8)
   goals met: 3 of 19
44. (stack b8 b17)
   deleted: (holding b8) (clear b17)
   added: (clear b8) (handempty) (on b8 b17)
   goals met: 4 of 19
45. (pick-up b13)
   deleted: (ontable b13) (clear b13) (handempty)
   added: (holding b13)
   goals met: 4 of 19
46. (stack b13 b8)
   deleted: (holding b13) (clear b8)
   added: (clear b13) (handempty) (on b13 b8)
   goals met: 5 of 19
47. (pick-up b6)
   deleted: (ontable b6) (clear b6) (handempty)
   added: (holding b6)
   goals met: 5 of 19
48. (stack b6 b13)
   deleted: (holding b6) (clear b13)
   added: (clear b6) (handempty) (on b6 b13)
   goals met: 6 of 19
49. (pick-up b7)
   deleted: (ontable b7) (clear b7) (handempty)
   added: (holding b7)
   goals met: 6 of 19
50. (stack b7 b6)
   deleted: (holding b7) (clear b6)
   added: (clear b7) (handempty) (on b7 b6)
   goals met: 7 of 19
51. (pick-up b4)
   deleted: (ontable b4) (clear b4) (handempty)
   added: (holding b4)
   goals met: 7 of 19
52. (stack b4 b7)
   deleted: (holding b4) (clear b7)
   added: (clear b4) (handempty) (on b4 b7)
   goals met: 8 of 19
53. (pick-up b16)
   deleted: (ontable b16) (clear b16) (handempty)
   added: (holding b16)
   goals met: 8 of 19
54. (stack b16 b4)
   deleted: (holding b16) (clear b4)
   added: (clear b16) (handempty) (on b16 b4)
   goals met: 9 of 19
55. (pick-up b3)
   deleted: (ontable b3) (clear b3) (handempty)
   added: (holding b3)
   goals met: 9 of 19
56. (stack b3 b16)
   deleted: (holding b3) (clear b16)
   added: (clear b3) (handempty) (on b3 b16)
   goals met: 10 of 19
57. (pick-up b11)
   deleted: (ontable b11) (clear b11) (handempty)
   added: (holding b11)
   goals met: 10 of 19
58. (stack b11 b3)
   deleted: (holding b11) (clear b3)
   added: (clear b11) (handempty) (on b11 b3)
   goals met: 11 of 19
59. (pick-up b20)
   deleted: (ontable b20) (clear b20) (handempty)
   added: (holding b20)
   goals met: 11 of 19
60. (stack b20 b11)
   deleted: (holding b20) (clear b11)
   added: (clear b20) (handempty) (on b20 b11)
   goals met: 12 of 19
61. (pick-up b9)
   deleted: (ontable b9) (clear b9) (handempty)
   added: (holding b9)
   goals met: 12 of 19
62. (stack b9 b20)
   deleted: (holding b9) (clear b20)
   added: (clear b9) (handempty) (on b9 b20)
   goals met: 13 of 19
63. (pick-up b2)
   deleted: (ontable b2) (clear b2) (handempty)
   added: (holding b2)
   goals met: 13 of 19
64. (stack b2 b9)
   deleted: (holding b2) (clear b9)
   added: (clear b2) (handempty) (on b2 b9)
   goals met: 14 of 19
65. (pick-up b12)
   deleted: (ontable b12) (clear b12) (handempty)
   added: (holding b12)
   goals met: 14 of 19
66. (stack b12 b2)
   deleted: (holding b12) (clear b2)
   added: (clear b12) (handempty) (on b12 b2)
   goals met: 15 of 19
67. (pick-up b14)
   deleted: (ontable b14) (clear b14) (handempty)
   added: (holding b14)
   goals met: 15 of 19
68. (stack b14 b12)
   deleted: (holding b14) (clear b12)
   added: (clear b14) (handempty) (on b14 b12)
   goals met: 16 of 19
69. (pick-up b19)
   deleted: (ontable b19) (clear b19) (handempty)
   added: (holding b19)
   goals met: 16 of 19
70. (stack b19 b14)
   deleted: (holding b19) (clear b14)
   added: (clear b19) (handempty) (on b19 b14)
   goals met: 17 of 19
71. (pick-up b15)
   deleted: (ontable b15) (clear b15) (handempty)
   added: (holding b15)
   goals met: 17 of 19
72. (stack b15 b19)
   deleted: (holding b15) (clear b19)
   added: (clear b15) (handempty) (on b15 b19)
   goals met: 18 of 19
73. (pick-up b5)
   deleted: (ontable b5) (clear b5) (handempty)
   added: (holding b5)
   goals met: 18 of 19
74. (stack b5 b15)
   deleted: (holding b5) (clear b15)
   added: (clear b5) (handempty) (on b5 b15)
   goals met: 19 of 19
